//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include "Screen3.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Screen3::Screen3() : AbstractTFTScreen("SCREEN3")
{
  
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen3::doSetup(TFTMenu* menu)
{
  // тут настраиваемся, например, можем добавлять кнопки
  screenButtons->addButton( 10 ,  30, 200,  50, "ВЕРНУТЬСЯ");
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen3::doUpdate(TFTMenu* menu)
{
    // тут обновляем внутреннее состояние
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen3::doDraw(TFTMenu* menu)
{
  UTFT* dc = menu->getDC();
  dc->setColor(VGA_RED);
  dc->setBackColor(VGA_WHITE);
  
  // тут рисуем, что надо именно нам, кнопки прорисуются сами после того, как мы тут всё отрисуем
  menu->print("Экран номер 3", 10, 0);
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void Screen3::onButtonPressed(TFTMenu* menu, int pressedButton)
{
  // обработчик нажатия на кнопку. Номера кнопок начинаются с 0 и идут в том порядке, в котором мы их добавляли
  if(pressedButton == 0)
    menu->switchToScreen("Main"); // переключаемся на первый экран

    

}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

