#pragma once
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include "InterruptHandler.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// результат сравнения списка прерываний с эталоном
typedef enum
{
  COMPARE_RESULT_NoSourcePulses, // нет исходных данных в списке
  COMPARE_RESULT_NoEthalonFound, // не найдено эталона для канала
  COMPARE_RESULT_RodBroken,      // штанга поломана
  COMPARE_RESULT_MatchEthalon,    // результат соответствует эталону
  COMPARE_RESULT_MismatchEthalon, // результат не соответствует эталону
  
} EthalonCompareResult;
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
class EthalonComparer
{
  public:
    static EthalonCompareResult Compare(InterruptTimeList& list, uint8_t channelNumber);
};
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
