#pragma once

//--------------------------------------------------------------------------------------------------------------------------------
// Защита от копирования прошивки
//--------------------------------------------------------------------------------------------------------------------------------
//#define PROTECT_ENABLED // закомментировать, если не надо защищать прошивку с использованием микросхемы ATSHA204A
#define SHA204A_PIN 69 // номер пина для микросхемы SHA204A

#define MAC_RESPONSE "23E7ECA82BB3A5D674C204FD04B5570F3CB8497A8D0708B6777F000BFE00804F57DC8F"
#define MAC_CHALLENGE 0x6A,0x4D,0xBF,0xEE,0x9A,0x82,0x43,0x8A,0x8A,0xA0,0x9D,0x4F,0x01,0x63,0x46,0x84,0x9F,0xA0,0x80,0xE1,0x2C,0x86,0x44,0xD3,0xBE,0x8A,0xB8,0x25,0x1D,0xAE,0x65,0xC4
