//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// генератор сигнала 50 Гц на трёх каналах со сдвигом фаз в 120 градусов
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include "CorePinScenario.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define DURATION 9875 // мкс между состояниями дадут нам меандр с частотой, близкой к 50 Гц
#define PHASE_SHIFT (DURATION/3) // сдвиг угла одной фазы относительно другой
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define LINE1 A4 // номер пина для линии 1
#define LINE2 A3 // номер пина для линии 2
#define LINE3 A2 // номер пина для линии 3
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
CorePinScenario scene1;
CorePinScenario scene2;
CorePinScenario scene3;
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#define PULSE_PIN A1 // номер пина для генерации тестовых импульсов
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
CorePinScenario pulseScene;
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void setup() 
{

  pinMode(LINE1,OUTPUT);
  pinMode(LINE2,OUTPUT);
  pinMode(LINE3,OUTPUT);

  pinMode(PULSE_PIN, OUTPUT);

  scene1.add({LINE1,HIGH,DURATION}); 
  scene1.add({LINE1,LOW,DURATION});
 

  scene2.add({LINE2,HIGH,DURATION});
  scene2.add({LINE2,LOW,DURATION});

  scene3.add({LINE3,HIGH,DURATION});
  scene3.add({LINE3,LOW,DURATION});

  // добавляем тестовые импульсы

  // сперва добавляем 10 импульсов по убыванию, от 20 мс до 2 мс, с шагом 2 мс
  unsigned long duration = 40000;
  uint8_t level = HIGH;
  for(int i=0;i<20;i++, duration -= 2000)
  {
    pulseScene.add({PULSE_PIN,level,duration});
    level = !level;
  }

  // затем добавляем 10 импульсов по возрастанию
  for(int i=0;i<20;i++, duration += 2000)
  {
    pulseScene.add({PULSE_PIN,level,duration});
    level = !level;    
  }

  // добавляем паузу в 5 секунд
  pulseScene.add({PULSE_PIN,LOW,5000000});
}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
void loop() 
{

  // сдвигаем фазы при старте

  delay(1);
  scene1.update();
  delayMicroseconds(PHASE_SHIFT);
  scene2.update();
  delayMicroseconds(PHASE_SHIFT);
  scene3.update();
  
  while(1)
  {
    scene1.update();
    scene2.update();
    scene3.update();

    pulseScene.update();
  }

}
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
